Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: A hotkey/hotstring can be made exempt from suspension by preceding it with the #SuspendExempt directive.
ja: ホットキー/ホットストリングの前に#SuspendExemptディレクティブを付けることで、サスペンドを免除することができます。

source: A hotstring has a pair of colons on each side of the text you want to trigger the text replacement.
ja: ホットストリングは、テキスト置換のトリガーとなるテキストの両側にコロンのペアが1つずつあります。

source: A hotstring may be typed even when the active window is ignoring your keystrokes.
ja: ホットストリングは、アクティブウィンドウがキーストロークを無視しているときでも入力できる場合があります。

source: A hotstring's default behavior can be changed in two possible ways:
ja: ホットストリングのデフォルトの動作は、2つの方法で変更することが可能です：

source: A hotstring's function can be called explicitly by the script only if the function has been named.
ja: ホットストリングの関数は、関数に名前が付けられている場合にのみ、スクリプトから明示的に呼び出すことができます。

source: A key and the value it is mapped to are known as a key-value pair.
ja: キーとそのキーに対応する値をキー・バリュー・ペアと呼びます。

source: A key may be any Integer, object reference or null-terminated String.
ja: キーは、整数、オブジェクト参照、ヌル文字で終端された文字列のいずれかを指定することができます。

source: A key or key-combination can be disabled for the entire system by having it do nothing.
ja: キーやキーの組み合わせは、何もしないことでシステム全体の機能を無効にすることができます。

source: A keypress is supposed to trigger some change within the target app (such as showing a new control or window), and sending another keypress before that happens will have the wrong effect.
ja: キープレスは、ターゲットアプリ内で何らかの変化（新しいコントロールやウィンドウの表示など）を引き起こすものであり、その前に別のキープレスを送信すると、間違った効果をもたらします。

source: A keyword search such as Controller and GetKeyState and Send is likely to produce topics of interest.
ja: Controller、GetKeyState、Sendなどのキーワードで検索すると、興味のあるトピックが見つかるだろう。

source: A label can also be used to identify a loop for the Continue and Break statements.
ja: ラベルは、Continue文やBreak文のループを識別するためにも使える。

source: A label consist of a name followed by a colon:
ja: ラベルは、名前とコロンで構成されています：

source: A label identifies a line of code, and can be used as a Goto target or to specify a loop to break out of or continue.
ja: ラベルはコード行を識別するもので、Gotoターゲットとして使用したり、ループから抜け出したり継続するループを指定したりすることができます。

source: A library file or function name.
ja: ライブラリファイル名または関数名です。

source: A library script typically contains a function or class which is designed to be used and reused in this manner.
ja: ライブラリ・スクリプトには通常、このように使用・再利用されるように設計された関数やクラスが含まれている。

source: A line that begins with AND or && (or any other operator) is automatically appended to the line above it.
ja: ANDまたは&&（あるいはその他の演算子）で始まる行は、自動的にその上の行に追加される。

source: A line that begins with OR or || (or any other operator) is automatically appended to the line above it.
ja: ORまたは||（あるいはその他の演算子）で始まる行は、自動的にその上の行に追加される。

source: A line that begins with a period (or any other operator) is automatically appended to the line above it.
ja: ピリオド（またはその他の演算子）で始まる行は、自動的にその上の行に追加される。

source: A list of all built-in functions can be found here.
ja: 内蔵関数の一覧はこちら。

source: A list of keys.
ja: キーの一覧です。

source: A list of language names and the corresponding language codes contained in the built-in variable A_Language.
ja: 組み込み変数A_Languageに含まれる言語名と対応する言語コードのリスト。

source: A list of language names, each of which is associated with a language code (also known as a locale identifier, LCID) that can be contained in the A_Language variable.
ja: 言語のリストです。各言語は、A_Language変数に格納できる言語コードと関連付けられています。言語コードはロケール識別子、LCIDとしても知られています。

source: A list of predefined classes.
ja: 定義済みクラスのリスト。

source: A list of zero or more keys, any one of which terminates the Input when pressed (the end key itself is not written to the Input buffer).
ja: 0個以上のキーのリストで、どれかが押されると入力が終了します（終了キー自体は入力バッファに書き込まれません）。

source: A literal quotation mark may be passed in by preceding it with a backslash (\").
ja: リテラル引用符は、その前にバックスラッシュ（ \")を付けることで渡すことができる。

source: A load-time error is displayed if an invalid class name is used, or if a class is inaccessible due to the presence of a local variable with the same name.
ja: 無効なクラス名を使用した場合や、同名のローカル変数が存在するためにクラスにアクセスできない場合、ロードタイムエラーが表示されます。

source: A load-time error is raised for more syntax errors than in v1, such as:
ja: など、v1よりも多くのシンタックスエラーに対してロードタイムエラーが発生します：

source: A macro is a series of scripted actions that is "played" upon demand.
ja: マクロは、要求に応じて「再生」される一連のスクリプト化されたアクションである。

source: A map can contain any number of key-value pairs, but each key must be unique.
ja: マップには、任意の数のキーと値のペアを含めることができますが、各キーは一意でなければなりません。

source: A match occurs if any of the alternatives is satisfied.
ja: 選択肢のいずれかを満たせばマッチとなる。

source: A match occurs when the pattern appears in either the file's long/normal name or its 8.3 short name.
ja: ファイルのロング/ノーマル名または8.3ショート名のいずれかにパターンがある場合、一致することになります。

source: A maximum of 7 ongoing calls to MsgBox are permitted, but any calls beyond the 7th cause an Error to be thrown.
ja: MsgBoxの呼び出しは最大7回まで可能ですが、7回目を超えるとErrorが投げられます。

source: A memory allocation failed.
ja: メモリの割り当てに失敗しました。

source: A menu usually looks like this:
ja: メニューは通常このような形になっています：

source: A message box usually looks like this:
ja: メッセージボックスは通常このように表示されます：

source: A method name.
ja: メソッド名。

source: A method/property invocation fails because the value does not implement that method/property.
ja: 値がそのメソッド/プロパティを実装していないため、メソッド/プロパティの呼び出しに失敗します。

source: A minimized window will still have a position and size.
ja: 最小化されたウィンドウは、位置とサイズを保持しています。

source: A modal dialog prevents the user from interacting with the GUI window until the dialog is dismissed.
ja: モーダルダイアログは、ダイアログが解除されるまで、ユーザーがGUIウィンドウと対話するのを防ぎます。

source: A modal input box prevents the user from interacting with the GUI window until the input box is dismissed.
ja: モーダル入力ボックスは、入力ボックスが解除されるまで、ユーザーがGUIウィンドウと対話するのを防ぎます。

source: A monitor function's last found window starts off as the parent window to which the message was sent (even if it was sent to a control).
ja: モニター機能で最後に見つかったウィンドウは、メッセージが送信された親ウィンドウとして始まります（コントロールに送信された場合も同様です）。

source: A multi-line expression can also begin with an open-parenthesis at the start of a line, provided that there is at least one other ( or ) on the first physical line.
ja: 複数行の表現は、最初の物理行に少なくとも1つの他の(または)がある場合に限り、行頭の開括弧で始めることもできます。

source: A naive attempt at a solution might be to simply add more quote marks:
ja: 単純に引用符を増やせばいいという安直な発想で解決できるかもしれません：

source: A negative StartingPos for InStr, SubStr, RegExMatch and RegExReplace is interpreted as a position from the end.
ja: InStr、SubStr、RegExMatch、RegExReplaceのStartingPosが負の場合、末尾からの位置と解釈されます。

source: A negative index can be used to address elements in reverse, so -1 is the last element, -2 is the second last element, and so on.
ja: 負のインデックスは、要素を逆にアドレスするために使用することができ、-1は最後の要素、-2は2番目の最後の要素、といった具合です。

source: A negative index can be used to address elements in reverse, so that -1 is the last element, -2 is the second last element, and so on.
ja: 負のインデックスは、-1が最後の要素、-2が2番目の最後の要素というように、要素を逆にアドレスするために使用することができます。

source: A nested function is automatically a closure if it captures any non-static local variables of the outer function.
ja: 入れ子になった関数は、外側の関数の非静的なローカル変数をキャプチャすれば、自動的にクロージャとなります。

source: A nested function is not accessible by name outside of the function which immediately encloses it, but is accessible anywhere inside that function, including inside other nested functions (with exceptions).
ja: ネストされた関数は、それを直ちに囲む関数の外では名前によってアクセスできませんが、その関数の内部では、他のネストされた関数の内部も含めて、どこでもアクセスできます（例外あり）。

source: A nested function may automatically "capture" non-static local variables from the enclosing function (under the right conditions), allowing them to be used after the enclosing function returns.
ja: ネストされた関数は、（適切な条件下で）包含関数から非静的ローカル変数を自動的に「捕捉」し、包含関数が戻った後に使用できるようにすることができます。

source: A nested function which has captured variables is known as a closure.
ja: 変数を捕捉した入れ子の関数はクロージャと呼ばれます。

source: A new GUI must be created (if needed).
ja: 新しいGUIを作成する必要があります（必要な場合）。

source: A new method of line continuation is supported in expressions and function/property definitions which utilizes the fact that each (/[/{ must be matched with a corresponding )/]/}.
ja: 式や関数・プロパティ定義では、(/[/{は、対応する)/]/}と一致させなければならないという事実を利用した新しい行継続の方法がサポートされています。

source: A nice thing to know is that you can have many lines of code for each hotkey, hotstring, label, and a lot of other things we haven't talked about yet.
ja: ホットキー、ホットストリング、ラベル、その他まだお話ししていない様々なものに対して、何行ものコードを書くことができます。

source: A non-null interface pointer for IDispatch or a derived interface.
ja: IDispatchまたは派生インターフェースの非NULLインターフェースポインタです。

source: A null-terminator is written and included in the return value only when there is sufficient space; that is, it is omitted when Length or Target.Size (multiplied by the size of a character) exactly equals the length of the converted string.
ja: つまり、LengthまたはTarget.Size（文字の大きさを乗じたもの）が変換後の文字列の長さにちょうど等しい場合は省略されます。

source: A number (integer) between 1 and the total number of supported devices.
ja: 1からサポートするデバイスの総数までの数値（整数）。

source: A number between 0 and 255 (inclusive) to indicate the allowed number of shades of variation in either direction for the intensity of the red, green, and blue components of the color.
ja: 0～255 の間の数値で、色の赤、緑、青の各成分の強さについて、いずれかの方向に許容される変化の階調数を示すものです。

source: A number of classes are predefined, effectively reserving those global variable names in the same way that a user-defined class would.
ja: 多くのクラスが事前に定義されており、ユーザー定義クラスと同じように、グローバル変数名を効果的に予約することができます。

source: A number of other DBGp clients are available, but have not been tested with AutoHotkey.
ja: 他にも多くのDBGpクライアントがありますが、AutoHotkeyでの動作確認はしていません。

source: A number of useful variables are built into the program and can be referenced by any script.
ja: プログラムには便利な変数が多数組み込まれており、どのスクリプトからも参照することができます。

source: A number to write.
ja: 書きこみの数。

source: A particular hotkey or hotstring can be defined more than once in the script if each definition has different #HotIf criteria.
ja: 特定のホットキーや ホットストリングは、それぞれの定義が異なる#HotIf基準であれば、スクリプト内で複数回定義することができます。

source: A particular hotkey or hotstring can be defined more than once in the script if each definition has different HotIf criteria.
ja: 特定のホットキーや ホットストリングは、それぞれの定義が異なるHotIf基準であれば、スクリプト内で複数回定義することができます。

source: A particular hotkey can be created more than once if each definition has different If criteria.
ja: 特定のホットキーは、各定義が異なる場合、複数回作成することができます。

source: A particular hotstring can be created more than once if each definition has different HotIf criteria, case-sensitivity (C vs. C0/C1), or word-sensitivity (?).
ja: 各定義が異なるHotIf基準、大文字小文字の区別（C vs. C0/C1）、または、単語の区別（?）を持つ場合、特定のホットストリングを複数回作成することができます。

source: A path can be normalized explicitly by passing it to GetFullPathName via the function defined below, before applying the prefix.
ja: パスは、プレフィックスを適用する前に、以下に定義する関数でGetFullPathNameに渡すことで、明示的に正規化することができます。

source: A path with the \\?\ prefix can also be normalized by this function.
ja: \\?\接頭辞を持つパスも、この関数で正規化できる。

source: A period (dot) with at least one space or tab on each side is used to combine two items into a single string.
ja: ピリオド(ドット)の両側に少なくとも1つのスペースまたはタブを入れ、2つの項目を1つの文字列にまとめる。

source: A picture may be used as a background around a ListView (that is, to frame the ListView).
ja: 画像は、ListViewの周囲の背景として使用することができます（つまり、ListViewをフレーム化する）。

source: A plus sign matches one or more of the preceding character, class, or subpattern.
ja: プラス記号は、直前の文字、クラス、サブパターンの1つ以上にマッチする。

source: A possible work-around is to add the hotkey *Tab::Send "{Blind}{Tab}" -- but be aware that it will likely interfere with using the real Alt to alt-tab.
ja: 可能な回避策は、*Tab::Send "{Blind}{Tab}"というホットキーを追加することです。しかし、これは本物の Alt を使って alt-tab するのを邪魔する可能性が高いので注意してください。

source: A prefix of 0x is tolerated if present.
ja: 0xの接頭辞があっても許容されます。

source: A property definition creates a dynamic property, which calls a method instead of simply storing or returning a value.
ja: プロパティ定義は、単に値を格納したり返したりするのではなく、メソッドを呼び出す動的プロパティを作成します。

source: A property definition with both get and set actually creates two separate functions, which do not share local or static variables or nested functions.
ja: getと setの両方を持つプロパティ定義は、実際には2つの別々の関数を作成し、ローカル変数や静的変数、入れ子関数を共有することはありません。

source: A property name.
ja: プロパティ名です。

source: A pseudo-array cannot be declared as a whole, so some "elements" may resolve to global (or captured) variables while others do not.
ja: 擬似配列は全体として宣言できないので、ある「要素」はグローバル（またはキャプチャ）変数に解決され、他の「要素」は解決されないことがあります。

source: A question mark matches zero or one of the preceding character, class, or subpattern.
ja: クエスチョンマークは、直前の文字、クラス、サブパターンの0個または1個にマッチする。

source: A quick and easy way to show information.
ja: 情報を素早く簡単に表示する方法です。

source: A real script should perform error-checking and override other methods, such as __Enum to support enumeration.
ja: 本当のスクリプトは、エラーチェックを行い、列挙をサポートする__Enumのような他のメソッドをオーバーライドすべきである。

source: A recent improvement is that the contents of the menu can change depending on which type of window is active (Notepad and Word are used as examples here).
ja: 最近の改良点は、アクティブなウィンドウの種類によってメニューの内容が変わることだ（ここではメモ帳とWordを例にしている）。

source: A reference is released by simply using an assignment to replace it with any other value.
ja: 参照は、代入を使用して他の任意の値に置き換えるだけで解放されます。

source: A reference stored in a variable is released automatically when that variable is assigned some other value.
ja: 変数に格納された参照は、その変数に他の値が代入されると自動的に解放される。

source: A reference to a output variable in which to store a number indicating the type of handle being returned:
ja: 出力変数への参照で、返されるハンドルの種類を示す数値を格納します：

source: A reference to a variable.
ja: 変数への参照。

source: A reference to the InputHook object.
ja: InputHookオブジェクトへの参照。

source: A reference to the output variable in which to store the directory of the file, including drive letter or share name (if present).
ja: ドライブ文字または共有名（存在する場合）を含む、ファイルのディレクトリを格納する出力変数への参照。

source: A reference to the output variable in which to store the drive letter or server name of the file.
ja: ファイルのドライブ文字またはサーバー名を格納する出力変数への参照。

source: A reference to the output variable in which to store the file name without its path, dot and extension.
ja: パス、ドット、拡張子を除いたファイル名を格納する出力変数への参照。

source: A reference to the output variable in which to store the file name without its path.
ja: パスを除いたファイル名を格納する出力変数への参照。

source: A reference to the output variable in which to store the file's extension (e.g. TXT, DOC, or EXE).
ja: ファイルの拡張子（TXT、DOC、EXEなど）を格納する出力変数への参照。

source: A reference to the output variable in which to store the filename of the shortcut's icon (blank if none).
ja: ショートカットのアイコンのファイル名を格納する出力変数への参照（ない場合は空白）。

source: A reference to the output variable in which to store the newly launched program's unique Process ID (PID).
ja: 新しく起動したプログラムの固有のProcess ID(PID)を格納する出力変数へのリファレンス。

source: A reference to the output variable in which to store the shortcut's comments (blank if none).
ja: ショートカットのコメントを格納する出力変数への参照（ない場合は空白）。

source: A reference to the output variable in which to store the shortcut's icon number within the icon file (blank if none).
ja: アイコンファイル内のショートカットのアイコン番号を格納する出力変数への参照（ない場合は空白）。

source: A reference to the output variable in which to store the shortcut's initial launch state, which is one of the following digits:
ja: ショートカットの初期起動状態を格納する出力変数への参照で、以下の数字のいずれかとなる：

source: A reference to the output variable in which to store the shortcut's parameters (blank if none).
ja: ショートカットのパラメータを格納する出力変数への参照（ない場合は空白）。

source: A reference to the output variable in which to store the shortcut's target (not including any arguments it might have).
ja: ショートカットのターゲットを格納する出力変数への参照（引数は含まれない）。

source: A reference to the output variable in which to store the shortcut's working directory.
ja: ショートカットの作業ディレクトリを格納する出力変数への参照。

source: A region containing borderless text that the user cannot edit.
ja: ユーザーが編集できない、境界のないテキストを含む領域。

source: A registry loop is useful when you want to operate on a collection registry values or subkeys, one at a time.
ja: レジストリループは、レジストリ値やサブキーのコレクションを一度に1つずつ操作したい場合に便利です。

source: A registry-loop is useful when you want to operate on a collection registry values or subkeys, one at a time.
ja: レジストリループは、レジストリ値やサブキーのコレクションを一度に1つずつ操作したい場合に便利です。

source: A remote server would send back a response containing the value of the property, and the proxy would return the value to its caller.
ja: リモートサーバーはプロパティの値を含む応答を送り返し、プロキシはその値を呼び出し元に返す。

source: A return value of 0 (false) does not necessarily indicate that the method cannot be called, as the value may have a __Call meta-function.
ja: 戻り値0 (false)は、値に__Callメタ関数が含まれる可能性があるため、必ずしもメソッドを呼び出せないことを示すわけではありません。

source: A return value of false does not necessarily indicate that the method cannot be called, as the value may have a __Call meta-function.
ja: 戻り値がfalseの場合、その値が__Callメタファンクションを持つ可能性があるため、必ずしもそのメソッドを呼び出すことができないことを示すものではありません。

source: A root directory will not contain a trailing backslash.
ja: ルートディレクトリには、末尾のバックスラッシュは含まれません。

source: A running script can usually be reloaded via its tray menu.
ja: 実行中のスクリプトは通常、トレイメニューからリロードできます。

source: A runtime error occurred in a script that is not persistent.
ja: 永続的でないスクリプトでランタイムエラーが発生しました。

source: A score is calculated based on which substrings matched, with the left-most substring having highest priority.
ja: どの部分文字列がマッチしたかに基づいてスコアが計算され、左端の部分文字列が最も優先される。

source: A script behaves as though the included file's contents are physically present at the exact position of the #Include directive (as though a copy-and-paste were done from the included file).
ja: スクリプトは、#Includeディレクティブの正確な位置に、インクルードファイルのコンテンツが物理的に存在するかのように動作します（まるでインクルードファイルからコピー＆ペーストが行われたかのようです）。

source: A script can activate, close, minimize, maximize, restore, hide, show or move almost any window.
ja: スクリプトは、ほとんどすべてのウィンドウをアクティブ化、クローズ、最小化、最大化、復元、非表示、表示、移動することができます。

source: A script can also crash when it specifies an inappropriate argument type or return type, such as claiming that an ordinary integer yielded by a function is an asterisk variable or str.
ja: また、関数が返す普通の整数をアスタリスク変数や strと主張するなど、不適切な引数型や戻り値を指定した場合にも、スクリプトがクラッシュすることがあります。

source: A script can also use EnvGet to read environment variables that it might have inherited from its parent process.
ja: また、スクリプトはEnvGetを使用して、親プロセスから継承した環境変数を読み込むことができます。

source: A script can detect and optionally abort a system shutdown or logoff via OnMessage(0x0011, On_WM_QUERYENDSESSION) (see OnMessage example #2 for a working script).
ja: スクリプトは、OnMessage(0x0011, On_WM_QUERYENDSESSION)によって、システムのシャットダウンやログオフを検出し、オプションで中止することができます（動作するスクリプトについては、OnMessage の例 #2を参照）。

source: A script can do as little as performing a single action and then exiting, but most scripts define a number of hotkeys, with each hotkey followed by one or more actions to take when the hotkey is pressed.
ja: スクリプトでできることは1つのアクションを実行して終了することだけですが、ほとんどのスクリプトでは、いくつかのホットキーを定義し、各ホットキーの後に、そのホットキーが押されたときに実行される1つまたは複数のアクションを記述します。

source: A script compiler (courtesy of fincs, with additions by TAC109) is included with the program.
ja: スクリプト・コンパイラ（fincs氏提供、TAC109氏追加）がプログラムに含まれている。

source: A script is always halted (though not officially paused) while it is displaying any kind of menu (tray menu, menu bar, GUI context menu, etc.)
ja: スクリプトが何らかのメニュー（トレイメニュー、メニューバー、GUIコンテキストメニューなど）を表示している間は、常に中断されます（正式には一時停止ではありません）。

source: A script is simply a plain text file with the .ahk filename extension containing instructions for the program, like a configuration file, but much more powerful.
ja: スクリプトとは、プログラムの指示を含む拡張子が.ahkのプレーンテキストファイルのことで、コンフィギュレーションファイルのようなものですが、より強力なものです。

source: A script may also contain hotkeys and hotstrings, or even consist entirely of them.
ja: スクリプトには、ホットキーや ホットストリングが含まれることもありますし、それらだけで構成されることもあります。

source: A script may also do its own backspacing via {bs 5}, which sends Backspace five times.
ja: また、スクリプトは{bs 5}でBackspaceを5回送信することもできます。

source: A script may create a new environment variable or change the contents of an existing one with EnvSet.
ja: スクリプトは、EnvSetを使用して新しい環境変数を作成したり、既存の環境変数の内容を変更したりすることができます。

source: A script may create more than one ListView per window.
ja: スクリプトは、1つのウィンドウに1つ以上のListViewを作成することができます。

source: A script may create more than one TreeView per window.
ja: スクリプトは、ウィンドウごとに複数のTreeViewを作成することができます。

source: A script may use the Size event to reposition and resize controls in response to the user's resizing of the window.
ja: スクリプトは、Size イベントを使用して、ユーザーによるウィンドウのサイズ変更に対応してコントロールの位置を変更したり、サイズを変更したりすることができます。

source: A script that checks the state of such a key immediately after it changed may use Sleep beforehand to give the system time to update the key state.
ja: このような鍵の状態を変更直後に確認するスクリプトは、鍵の状態を更新する時間をシステムに与えるために、事前にSleepを使用することができます。

source: A script-based DBGp library and example clients are available from GitHub.
ja: スクリプトベースのDBGpライブラリとサンプルクライアントは、GitHubから入手可能です。

source: A separator line can be converted to a normal item by specifying the position& of the separator and a non-blank NewName, and then using the Add method to give the item a callback or submenu.
ja: 区切り線の位置と空白でないNewNameを指定し、Addメソッドでコールバックやサブメニューを与えることで、区切り線を通常のアイテムに変換することができます。

source: A sequence of numbers can be written by repeating Type and Number any number of times after the first Number.
ja: 最初のNumberの後にTypeと Numberを任意の回数繰り返すことで、一連のNumberを記述することができます。

source: A series of zero or more of the following option letters.
ja: 以下のオプション文字のうち、0個以上を連続させたもの。

source: A service identifier in the same form as IID.
ja: IIDと同形式のサービス識別子。

source: A short delay (sleep) is done automatically after every Control function that changes a control.
ja: 制御を変更するすべての制御機能の後に、短い遅延（スリープ）が自動的に行われます。

source: A short delay (sleep) is done automatically after every keystroke sent by Send or ControlSend.
ja: SendまたはControlSendでキーストロークを送信するたびに、短い遅延（スリープ）が自動的に行われます。

source: A short delay (sleep) is done automatically after every mouse movement or click generated by Click and MouseMove/Click/Drag (except for SendInput mode).
ja: クリックやマウスムーブ/クリック/ドラッグで発生するマウス移動やクリックの度に、短い遅延（スリープ）が自動的に行われます（SendInput modeを除く）。

source: A short delay (sleep) is done automatically after every mouse movement or click generated by Click, MouseMove, MouseClick, and MouseClickDrag (except for SendInput mode).
ja: SendInputモードを除いて、Click関数、MouseMove関数、MouseClick関数、MouseClickDrag関数によって生成される全てのマウスの動きまたはクリックの後に自動的に短時間の遅延（スリープ）が発生します。

source: A short delay (sleep) is done automatically after every windowing function except WinActive and WinExist.
ja: WinActiveと WinExistを除くすべてのウィンドウ関数の後に、短いディレイ（スリープ）が自動的に行われる。

source: A shorter delay may be achieved via Loop+Sleep as demonstrated at DllCall+timeBeginPeriod+Sleep.
ja: DllCall+timeBeginPeriod+Sleepのように、Loop+Sleepでより短い遅延を達成することもできる。

source: A similar method can be used to get the long name of an 8.3 short name.
ja: 同様の方法で、8.3ショートネームのロングネームを取得することができます。

source: A similar technique might work in other browsers:
ja: 他のブラウザでも同様の手法が使えるかもしれません：

source: A simple function definition can be used to create an enumerator; in that case, the Call method is implied.
ja: 単純な関数定義を使用して列挙者を作成することができる。その場合、Callメソッドが暗示されます。

source: A simplified version of multi-select in which control-click and shift-click are not necessary because normal left clicks serve to extend the selection or de-select a selected item.
ja: マルチセレクトの簡易版で、通常の左クリックで選択範囲を広げたり、選択した項目の選択を解除したりできるので、controlクリックやshiftクリックは必要ない。

source: A single multi-statement line does not need to be enclosed in braces.
ja: 1つの複数文の行は、中括弧で囲む必要はありません。

source: A single device driver or physical device often has multiple endpoints, such as for different types of output or input.
ja: 1つのデバイスドライバや物理デバイスが、異なるタイプの出力や入力など、複数のエンドポイントを持つことはよくある。

source: A single letter, number, or the name of a single key from the key list (mouse buttons and other non-standard keys might not be supported).
ja: 文字、数字、またはキーリストの中から1つのキーの名前（マウスボタンやその他の非標準的なキーはサポートされない場合があります）。

source: A single script can have multiple simultaneous MsgBox, InputBox, FileSelect, and DirSelect dialogs.
ja: 1つのスクリプトで複数のMsgBox、InputBox、FileSelect、DirSelectダイアログを同時に表示することができます。
